In [2]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv("C:\\Users\\Welcome\\Documents\\Book1.csv")

In [6]:
df

     Customer ID  Gender  Age  Annual Income  Spending score
0              1    MALE   58         769135          454117
1              2    MALE   60         535104          556588
2              3    MALE   55         872628          521914
3              4    MALE   52         850931          549842
4              5    MALE   42         216447          664023
..           ...     ...  ...            ...             ...
194          195  FEMALE   60         608101          372772
195          196  FEMALE   57         686653          524919
196          197  FEMALE   34         922974          446758
197          198  FEMALE   41         577747           80539
198          199  FEMALE   32         702998          621241

[199 rows x 5 columns]

In [10]:
df.dtypes

Customer ID        int64
Gender            object
Age                int64
Annual Income      int64
Spending score     int64
dtype: object

In [14]:
df['Gender'] = pd.to_numeric(df['Gender'], errors='coerce')

In [15]:
df.select_dtypes(include=['number']).mean()

Customer ID          100.000000
Gender                      NaN
Age                   42.879397
Annual Income     562326.989950
Spending score    373762.417085
dtype: float64

In [16]:
df.loc[:,'Age'].mean()

42.879396984924625

In [17]:
df.mean(axis=1)[0:4]

0    305827.75
1    272938.50
2    348650.00
3    350207.25
dtype: float64

In [18]:
df.median()

Customer ID          100.0
Gender                 NaN
Age                   42.0
Annual Income     549785.0
Spending score    392336.0
dtype: float64

In [19]:
df.loc[:,'Age'].median()

42.0

In [20]:
df.median(axis=1)[0:4]

0    227087.5
1    267582.0
2    260984.5
3    274947.0
dtype: float64

In [21]:
df.mode()

     Customer ID  Gender   Age  Annual Income  Spending score
0              1     NaN  60.0         203090           21330
1              2     NaN   NaN         203949           25259
2              3     NaN   NaN         204418           25449
3              4     NaN   NaN         207543           27941
4              5     NaN   NaN         212702           30099
..           ...     ...   ...            ...             ...
194          195     NaN   NaN         977076          685559
195          196     NaN   NaN         981353          686130
196          197     NaN   NaN         984972          692532
197          198     NaN   NaN         985249          697390
198          199     NaN   NaN         993749          699610

[199 rows x 5 columns]

In [22]:
df.loc[:,'Age'].mode()

0    60
Name: Age, dtype: int64

In [23]:
df.min()

Customer ID            1.0
Gender                 NaN
Age                   25.0
Annual Income     203090.0
Spending score     21330.0
dtype: float64